{
  "id": "제조업-임금보너스-파업-2025-09-08T06-15-11",
  "title": "제조업 임금/보너스 파업 협상: 위기 관리와 노사 화합",
  "description": "한빛 제조업체는 최근 경기 악화에도 불구하고 5% 임금 인상과 특별 보너스를 요구하는 노동조합의 파업 예고로 비상사태에 직면했습니다. 경영진은 기업의 생존과 고용 안정성 유지를 주장하며 난색을 표하고 있으며, 사측과 노조 간의 갈등이 심화되고 있습니다. 인사 담당자는 파국을 막고 노사 양측이 상생할 수 있는 합리적인 해결책을 1주일 내에 도출해야 합니다. 이 시나리오는 갈등 중재, 협상 전략 수립, 그리고 Win-Win 솔루션 도출 역량을 강화하기 위해 기획되었습니다.",
  "context": {
    "situation": "한빛 제조업체는 심각한 노사 갈등을 겪고 있습니다. 노동조합은 전년도 회사 실적 개선에도 불구하고 동결된 임금과 보너스에 불만을 품고 5% 임금 인상 및 특별 보너스를 요구하며 파업을 예고했습니다. 경영진은 원자재 가격 상승과 글로벌 경기 불확실성을 이유로 난색을 표하며, 파업 시 공장 가동 중단으로 인한 막대한 손실과 기업 이미지 실추를 우려하고 있습니다. 현재 노사 양측의 주장이 팽팽하게 맞서고 있으며, 사태 해결을 위한 긴급 협상이 필요합니다.",
    "timeline": "파업 예고일이 1주일 앞으로 다가왔습니다. 이 기간 내에 협상을 타결하지 못하면 전면 파업이 불가피합니다.",
    "stakes": "노조의 요구를 전면 수용할 경우 회사의 재정적 부담이 심화되고 경영 위기로 이어질 수 있으며, 반대로 요구를 묵살할 경우 장기 파업으로 인한 생산 차질, 기업 이미지 훼손, 직원 사기 저하로 회사 전체의 경쟁력이 약화될 수 있습니다. 비용 절감과 임직원 사기 진작 사이의 균형점을 찾는 것이 중요합니다.",
    "playerRole": {
      "position": "인사 담당자",
      "department": "인사팀",
      "experience": "1년차",
      "responsibility": "노사 간의 원만한 합의를 이끌어내고, 회사와 직원이 모두 만족할 수 있는 실현 가능한 해결책을 제시하여 파업을 막고 조속히 생산 활동을 정상화시키는 것이 주된 책임입니다."
    }
  },
  "objectives": [
    "파업 돌입 전, 1주일 이내에 노사 간의 최종 합의를 이끌어낼 것",
    "회사의 재정적 부담을 최소화하면서도 직원들의 핵심 요구사항을 일부 수용하는 방안을 마련할 것",
    "협상 과정에서 노사 양측의 신뢰를 회복하고, 향후 건설적인 노사 관계의 기반을 마련할 것",
    "임금 및 보너스 문제 외에 근로 조건 개선 등 추가적인 합의 가능성을 모색하여 Win-Win 전략을 수립할 것"
  ],
  "successCriteria": {
    "optimal": "노사 양측이 임금 인상 및 보너스에 대한 합의점을 찾아 파업을 철회하고, 추가적인 근로 환경 개선 논의를 위한 노사 협의체 구성에 동의하여 신뢰를 공고히 하는 결과. (예: 2% 임금 인상, 성과급 일부 지급, 복지 혜택 확대 등 다각적 합의)",
    "good": "파업은 면했지만, 임금 인상률이나 보너스 지급 규모에 대해 노사 양측 중 한쪽이 아쉬움을 남기면서 최소한의 합의가 이루어진 결과. (예: 1% 임금 인상, 보너스 재논의 조건부 합의)",
    "acceptable": "파업은 피했으나, 주요 쟁점에 대한 부분적 합의에 그치고, 잠재적인 불만이 남아 향후 노사 갈등의 불씨가 될 수 있는 결과. (예: 임금 인상 동결, 대신 복지 혜택 소폭 확대 등 임시방편적 합의)",
    "failure": "협상 결렬로 전면 파업이 강행되어 생산 라인이 중단되고, 회사 이미지 및 재무적 손실이 심각해지는 결과."
  },
  "personas": [
    {
      "id": "istj",
      "name": "김영수",
      "gender": "male",
      "department": "생산관리팀",
      "position": "과장",
      "experience": "12년차",
      "personaRef": "istj.json",
      "stance": "회사의 생산 효율성과 규정 준수를 최우선으로 생각합니다. 현재의 파업 위기는 생산 계획에 심각한 차질을 초래하며, 비합리적인 요구는 회사의 장기적인 재정 안정성을 해칠 것이라고 우려합니다. 원칙과 데이터에 기반한 해결책을 선호하며, 감정적인 접근은 배제해야 한다고 주장합니다.",
      "goal": "파업을 막고 생산 일정에 지장이 없도록 하며, 회사의 규정과 예산 범위 내에서 실현 가능한 수준의 합의를 도출하는 것입니다. 불필요한 지출을 최소화하고 장기적인 생산 안정성을 확보하기를 원합니다.",
      "tradeoff": "회사의 규정 내에서 직원 복지 관련 소액의 투자는 고려할 수 있지만, 임금 인상이나 보너스 등 직접적인 비용 증가는 최소화해야 한다고 생각합니다."
    },
    {
      "id": "isfj",
      "name": "박선영",
      "gender": "female",
      "department": "재무팀",
      "position": "대리",
      "experience": "5년차",
      "personaRef": "isfj.json",
      "stance": "현재 회사의 재정 상황이 매우 어렵다는 것을 잘 알고 있으며, 파업으로 인한 추가적인 재정 손실을 가장 우려합니다. 직원들의 어려움에는 공감하지만, 회사의 존속과 모든 직원의 고용 유지를 위해 비용 절감이 필수적이라고 생각합니다. 조화로운 해결을 원하지만, 현실적인 재정 제약을 강조할 것입니다.",
      "goal": "회사의 재정 건전성을 유지하면서도 직원들의 불만을 최소화할 수 있는 균형 잡힌 해결책을 찾는 것입니다. 특히, 현금 유동성에 문제가 생기지 않도록 하는 것이 중요하다고 생각합니다.",
      "tradeoff": "직접적인 임금 인상보다는 비정기적인 성과 보너스나 복리후생 개선 등 회사의 단기 재정 부담을 줄일 수 있는 대안적인 제안에 대해 논의할 의향이 있습니다."
    },
    {
      "id": "infj",
      "name": "이지원",
      "gender": "female",
      "department": "생산1팀",
      "position": "노동조합 대표 (팀장 겸직)",
      "experience": "8년차",
      "personaRef": "infj.json",
      "stance": "직원들의 고충과 불만에 깊이 공감하며, 회사가 약속했던 보상을 제대로 이행하지 않아 실망감이 크다고 생각합니다. 단순한 임금 인상뿐만 아니라, 직원들의 사기 저하와 미래에 대한 불안감을 해소하고 장기적인 회사와 직원의 신뢰 관계를 회복해야 한다고 주장합니다. 대화를 통해 근본적인 문제 해결을 원합니다.",
      "goal": "직원들의 정당한 요구가 관철되어 사기가 진작되고, 회사와 직원 간의 상호 존중과 신뢰를 바탕으로 한 건강한 노사 관계가 구축되는 것입니다. 단순히 금전적 보상뿐 아니라, 직원들의 의견이 존중받는 문화를 만들고 싶어 합니다.",
      "tradeoff": "파업은 최후의 수단이며, 회사가 진정성 있는 개선 의지를 보인다면, 임금 인상 폭을 일부 조정하거나, 보너스 지급 시기를 조절하는 등 유연한 접근을 고려할 수 있습니다. 다만, 근본적인 불만이 해소될 수 있는 장기적인 대책 마련이 선행되어야 합니다."
    }
  ],
  "recommendedFlow": [
    "istj",
    "isfj",
    "infj"
  ],
  "difficulty": 3,
  "estimatedTime": "60-90분",
  "skills": [
    "갈등 중재",
    "협상",
    "문제 해결",
    "의사소통",
    "리더십",
    "공감 능력"
  ]
}