{
  "id": "팀워크-붕괴-crisis-2025-09-09T07-28-12",
  "title": "팀워크 붕괴 위기: 서비스 기획 갈등 중재 시나리오",
  "description": "신규 서비스 기획팀 내 극심한 갈등으로 프로젝트가 지연되고 있습니다. 팀원들은 모든 사안에서 서로의 의견에 반대하며 심각한 논쟁을 지속하고 있습니다. 조직문화, 개인의 성향, 그리고 당장의 퍼포먼스 달성이라는 세 가지 핵심 가치가 첨예하게 대립하는 가운데, 팀장은 이 복잡한 상황을 중재하고 팀원들이 합의에 도달하도록 이끌어야 합니다. 서비스 방향에 대한 최종 결정을 며칠 내로 내려야 하는 긴급한 상황입니다.",
  "context": {
    "situation": "신규 서비스 기획팀 내에서 팀원들이 모든 안건에 대해 서로의 의견에 반대하며 극심한 논쟁을 벌이고 있습니다. 특히, 서비스의 방향성을 두고 조직의 장기적인 비전과 효율성, 개인의 창의적인 아이디어 및 업무 방식, 그리고 단기적인 성과 달성 압박이 복합적으로 충돌하고 있습니다.",
    "timeline": "신규 서비스 기획의 최종 방향을 3일 내로 확정하고, 다음 주까지 세부 기획안을 제출해야 합니다.",
    "stakes": "팀원 간 갈등으로 인한 프로젝트 지연은 팀 전체의 사기 저하와 생산성 하락을 넘어, 예정된 출시 일정에 차질을 주어 회사 전체의 사업 목표 달성에 부정적인 영향을 미칠 수 있습니다. 조직의 화합, 개인의 업무 만족도, 그리고 프로젝트의 성공적인 완수라는 세 가지 중요한 가치가 위협받고 있습니다.",
    "playerRole": {
      "position": "팀장",
      "department": "기획팀",
      "experience": "1년차",
      "responsibility": "팀원 간 갈등을 효과적으로 중재하고, 모든 팀원이 수용 가능한 서비스 기획 방향을 도출하여 프로젝트를 기한 내에 성공적으로 이끄는 것"
    }
  },
  "objectives": [
    "팀원 각자의 핵심적인 우려사항과 요구사항을 명확히 파악하고 이해한다.",
    "팀원 간의 건설적인 대화를 유도하고 상호 존중하는 분위기를 조성한다.",
    "조직의 목표와 개인의 기여, 프로젝트의 성공 가능성을 모두 고려한 최적의 합의점을 도출한다.",
    "합의된 기획 방향을 바탕으로 다음 업무 단계로 원활하게 진행될 수 있는 구체적인 실행 계획을 수립한다."
  ],
  "successCriteria": {
    "optimal": "모든 팀원이 합의된 기획 방향에 진심으로 동의하고, 각자의 의견이 충분히 반영되었다고 느끼며, 이후 협력적인 태도로 프로젝트에 임하는 상태로 갈등이 완전히 해소됨.",
    "good": "대부분의 팀원이 합의된 기획 방향을 수용하고, 핵심적인 이견들이 조율되어 프로젝트 진행에 필요한 최소한의 합의가 이루어졌으며, 팀워크가 개선될 조짐을 보임.",
    "acceptable": "갈등이 표면적으로는 진정되었으나 일부 팀원의 불만이 남아있고, 기획 방향에 대한 형식적인 동의는 얻었으나 적극적인 참여는 미지수이며, 추가적인 조정이 필요할 수 있는 상태.",
    "failure": "갈등이 더욱 심화되거나, 팀원들이 합의점을 찾지 못해 프로젝트가 중단될 위기에 처하고, 비현실적이거나 비효율적인 해결책으로 인해 팀의 기능이 마비됨."
  },
  "personas": [
    {
      "id": "istj",
      "name": "박준호",
      "department": "서비스 운영팀",
      "position": "과장",
      "experience": "8년차",
      "personaRef": "istj.json",
      "stance": "기존 서비스 운영 경험을 바탕으로 안정성과 효율성을 최우선으로 생각합니다. 새로운 기능 도입이나 급격한 변화보다는 검증된 방식과 데이터 기반의 접근을 선호하며, 예측 불가능한 위험을 최소화해야 한다고 주장합니다.",
      "goal": "현재 서비스의 안정적인 운영과 장기적인 효율성 유지. 검증되지 않은 위험 요소를 제거하고, 명확한 근거와 계획 하에 프로젝트를 진행하는 것.",
      "tradeoff": "개인의 창의적인 아이디어는 좋지만, 안정적인 진행과 데이터 기반의 확실한 효과를 보장받는다면 일부 변화를 수용할 의향이 있습니다."
    },
    {
      "id": "isfj",
      "name": "최은영",
      "department": "고객지원팀",
      "position": "대리",
      "experience": "4년차",
      "personaRef": "isfj.json",
      "stance": "고객의 니즈와 만족도를 가장 중요하게 생각합니다. 팀원들 간의 불필요한 갈등으로 고객 서비스 품질이 저하될까 우려하며, 모든 팀원이 조화롭게 협력하여 고객에게 더 나은 가치를 제공해야 한다고 믿습니다. 감정적인 대립보다 서로를 이해하고 배려하는 분위기를 원합니다.",
      "goal": "팀원들 간의 조화로운 관계 회복과 고객 만족도 향상. 갈등으로 인해 고객에게 피해가 가지 않도록 하는 것.",
      "tradeoff": "팀워크와 조화가 유지될 수 있다면, 자신의 개인적인 의견보다는 팀 전체의 합의에 따를 의향이 있으며, 다른 팀원의 부담을 덜어주기 위한 부분적인 희생도 고려할 수 있습니다."
    },
    {
      "id": "infj",
      "name": "이지현",
      "department": "마케팅팀",
      "position": "주임",
      "experience": "2년차",
      "personaRef": "infj.json",
      "stance": "서비스의 장기적인 비전과 사회적 가치를 중요하게 생각합니다. 단순히 단기적인 성과를 넘어, 우리 서비스가 사용자들에게 어떤 긍정적인 영향을 미칠 수 있는지에 집중해야 한다고 주장하며, 팀원들의 개인적인 성장과 잠재력을 발휘할 수 있는 환경을 중요하게 생각합니다.",
      "goal": "서비스의 본질적인 가치와 장기적인 영향력을 실현하고, 팀원들이 의미 있는 목표를 향해 함께 나아가는 것.",
      "tradeoff": "단기적인 성과를 위해 서비스의 본질적인 가치를 훼손하지 않는 선에서, 현실적인 제약과 타협점을 찾아낼 수 있다면 일부 전략적인 조정을 받아들일 수 있습니다."
    },
    {
      "id": "intj",
      "name": "김태민",
      "department": "개발팀",
      "position": "선임",
      "experience": "6년차",
      "personaRef": "intj.json",
      "stance": "가장 효율적이고 논리적인 해결책을 선호합니다. 비효율적인 논쟁이나 감정적인 접근보다는 명확한 데이터와 분석을 통해 최적의 결과를 도출해야 한다고 주장합니다. 현재의 갈등 상황 자체가 비효율적이며, 본질적인 문제 해결에 집중해야 한다고 봅니다.",
      "goal": "서비스 개발의 효율성 극대화와 기술적 완성도 추구. 불필요한 과정을 제거하고, 논리적으로 가장 타당한 기획 방향을 확정하는 것.",
      "tradeoff": "기술적인 구현 난이도나 효율성 측면에서 합리적인 대안이 제시된다면, 일부 비전이나 고객 경험 관련 요구사항에 대해 유연하게 검토할 수 있습니다. 단, 그 결정이 논리적으로 타당해야 합니다."
    }
  ],
  "recommendedFlow": [
    "intj",
    "istj",
    "infj",
    "isfj"
  ],
  "difficulty": 3,
  "estimatedTime": "60-90분",
  "skills": [
    "갈등 중재",
    "협상",
    "문제 해결",
    "의사소통",
    "리더십",
    "논리적 사고",
    "공감 능력"
  ]
}