{
  "id": "해외법인-법률-개정에-2025-09-08T05-21-22",
  "title": "해외법인 법률 개정에 따른 현지 파견 인력 위기 대응 전략 수립",
  "description": "해외 A법인에서 불법 취업 단속 관련 법률이 강화되어, 기존에 관행적으로 사용하던 비자로는 현지 주재원 및 출장자 파견이 불가능해졌습니다. 이는 갑작스러운 인력 수급 문제와 파견 불가 리스크를 초래하여, 현지 공장의 생산 라인 가동에 심각한 차질이 예상됩니다. 특히, 3일 이내에 대체 방안을 마련하지 못하면 생산 중단이 불가피하며, 이는 납기 지연에 따른 막대한 손실과 더불어 법적 리스크까지 야기할 수 있는 심각한 상황입니다. 인사 담당자로서 이 위기를 해결할 방안을 모색해야 합니다.",
  "context": {
    "situation": "해외 A법인의 불법 취업 단속 관련 법률 개정으로 기존 관행적으로 사용하던 비자로는 현지 근무 및 출장이 불가능해졌습니다. 이로 인해 인력 수급 및 파견 불가 리스크가 커져, 법인 생산 차질이 우려되는 상황입니다.",
    "timeline": "현 생산 체제를 3일 이상 유지할 수 없어, 3일 이내에 인력 파견 및 운영에 대한 구체적인 해결책을 마련해야 합니다.",
    "stakes": "납기 준수(고객 신뢰 및 위약금) vs. 추가 비용 발생(합법적 비자 취득 및 대체 인력 확보) vs. 사법 리스크(벌금 및 기업 이미지 손상).",
    "playerRole": {
      "position": "인사 담당자",
      "department": "인사팀",
      "experience": "5년차",
      "responsibility": "해외법인 인력 파견 관련 법률 준수 및 생산 차질 방지, 최적의 인력 운영 방안 마련"
    }
  },
  "objectives": [
    "개정된 해외법인 법률에 부합하는 인력 파견 솔루션 도출",
    "3일 이내 현지 생산 라인 유지 방안 제시 및 실행 계획 수립",
    "납기 지연 및 사법 리스크 최소화 방안 마련",
    "단기 및 장기적 관점에서 안정적인 해외법인 인력 운영 계획 제안"
  ],
  "successCriteria": {
    "optimal": "3일 이내 법률 준수 가능한 인력 파견 및 운영 방안을 확정하고, 추가 비용 및 생산 차질을 최소화하여 모든 이해관계자가 만족하는 해결책을 제시함.",
    "good": "법률적 리스크를 해소하고 생산 차질을 방지할 수 있는 단기적 해결책을 마련했으나, 일부 추가 비용 발생 또는 장기적 안정성 확보를 위한 추가 논의가 필요한 상황.",
    "acceptable": "현지 법률 위반 리스크는 피했으나, 생산 차질이 일부 발생하거나 예상보다 높은 추가 비용을 감수해야 하는 해결책을 제시함.",
    "failure": "법률 위반 리스크가 해결되지 않거나, 생산 라인 중단이 발생하여 납기 지연 및 막대한 손실을 초래하는 비현실적인 방안을 제시함."
  },
  "personas": [
    {
      "id": "istj",
      "name": "김성민",
      "department": "생산관리팀",
      "position": "대리",
      "experience": "7년차",
      "personaRef": "istj.json",
      "stance": "현지 법률 준수는 당연하지만, 무엇보다 생산 일정에 차질이 없어야 합니다. 갑작스러운 인력 변경은 생산 효율과 품질에 영향을 줄 수 있으므로, 현재까지의 생산 계획을 유지하면서 법적 문제를 해결할 수 있는 가장 확실하고 안전한 방법을 찾아야 합니다. 불확실한 대안보다는 검증된 절차와 명확한 가이드라인을 선호하며, 비상 계획도 철저하게 수립되어야 합니다.",
      "goal": "생산 라인 중단 없이 현지 법률 리스크를 완벽하게 해소하고, 예측 가능한 범위 내에서 비용을 관리하며 안정적인 생산 시스템을 유지하는 것.",
      "tradeoff": "단기적으로는 일부 추가 비용이 발생하더라도 법적 리스크를 완전히 제거하고 생산 일정을 지키는 것이 중요하다고 생각합니다. 다만, 비효율적인 절차나 불필요한 비용 증가는 최대한 피하고 싶습니다."
    }
  ],
  "recommendedFlow": [
    "istj"
  ],
  "difficulty": 3,
  "estimatedTime": "60-90분",
  "skills": [
    "갈등 중재",
    "협상",
    "문제 해결",
    "의사소통",
    "리스크 관리"
  ]
}