{
  "id": "해외-법인-노동법-2025-09-17T06-15-43",
  "title": "해외 법인 노동법 개정 준수 방안 마련",
  "description": "해외 법인에 강화된 노동법이 한 달 후 시행됩니다. 이 법을 준수하면 막대한 운영 비용이 발생해 본사 수익성에 타격이 예상됩니다. 하지만 법 위반 시 벌금, 이미지 손실, 법인 폐쇄 위험이 따릅니다. 운영 팀장은 해외 법인의 운영 지속 여부를 결정하고, 법적 리스크를 최소화하면서 사업 효율성을 유지할 최적의 해결책을 제시해야 합니다. 본 시나리오는 비용, 법률 준수, 직원 복지, 사업 연속성 사이의 균형점을 찾는 데 초점을 맞춥니다.",
  "context": {
    "situation": "해외 서비스 법인에서 한 달 후 시행될 새로운 노동법으로 인해 현행 직원 대우 방식으로는 법률 준수가 불가능해졌다. 법을 준수하려면 상당한 운영 비용이 증가하고, 이는 서비스 지속 가능성에 심각한 위협이 된다. 반대로 법을 위반할 경우 법적 제재, 기업 이미지 손상, 그리고 궁극적으로 법인 폐쇄 위험이 있다. 운영팀장으로서 이 난국을 해결하고 회사의 리스크를 최소화해야 한다.",
    "timeline": "새로운 노동법 시행까지 1개월.",
    "stakes": "해외 법인의 지속적인 운영, 폐업, 또는 다른 국가로의 이전 결정. 본사 전체의 재정적 안정성 및 기업 윤리 이미지. 현지 직원들의 고용 안정성.",
    "playerRole": {
      "position": "운영 팀장",
      "department": "운영팀",
      "experience": "10년차 이상",
      "responsibility": "해외 법인의 법률 준수 및 사업 연속성을 위한 최적의 전략 수립 및 본사 보고. 이해관계자 간의 의견 조율 및 실행 계획 마련."
    }
  },
  "objectives": [
    "해외 법인의 새로운 노동법 준수 방안을 1개월 이내에 수립하고 본사에 보고한다.",
    "법률 준수 비용과 사업 지속 가능성 사이의 균형점을 찾아 재정적 리스크를 최소화한다.",
    "해외 법인 직원들의 고용 안정성을 최대한 보장하는 방안을 모색한다.",
    "법인 운영, 폐업, 이전을 포함한 다양한 대안을 검토하고 각 대안의 장단점 및 파급효과를 분석하여 최적의 Win-Win 전략을 제시한다."
  ],
  "successCriteria": {
    "optimal": "새로운 노동법을 완벽히 준수하면서도 해외 법인의 서비스 운영을 유지하고, 본사의 재정적 부담을 최소화하는 혁신적인 방안을 찾아 법인 존속 및 성장 가능성 확보. 모든 이해관계자(본사, 현지 직원, 운영팀)가 만족하는 합의 도출.",
    "good": "새로운 노동법 준수를 위한 구체적인 실행 계획을 수립하고, 법인 운영을 지속하되 일부 비용 상승을 감수한다. 본사의 리스크를 합리적인 수준으로 관리하고, 현지 직원들의 고용 안정성 확보 노력 인정.",
    "acceptable": "법률 준수를 위한 최소한의 방안을 마련하고, 법인 운영 지속 여부를 결정한다. 본사의 재정적 손실을 막기 위해 일부 서비스 축소 또는 인력 구조조정 등 고통 분담을 포함한 절충안 도출.",
    "failure": "새로운 노동법 준수 방안을 찾지 못해 법인 폐쇄 결정 또는 막대한 벌금 및 기업 이미지 손상 초래. 이해관계자 간의 갈등 심화로 합의에 이르지 못함."
  },
  "personas": [
    {
      "id": "istj",
      "name": "이성준",
      "department": "법무팀",
      "position": "법무팀장",
      "experience": "15년차",
      "personaRef": "istj.json",
      "stance": "법률 준수는 선택이 아닌 필수입니다. 아무리 비용이 들더라도 법적 리스크를 감수해서는 안 됩니다. 장기적인 관점에서 회사의 명성과 안정성을 지키는 것이 중요합니다. 비용 절감보다는 법률 준수 방안 마련에 집중해야 합니다.",
      "goal": "새로운 노동법을 완벽히 준수할 수 있는 현실적인 방안을 수립하여 회사의 법적 리스크를 0으로 만드는 것.",
      "tradeoff": "단기적인 운영 비용 상승은 불가피하다고 보며, 법적 안정성을 위해 어느 정도의 재정적 부담은 감수할 수 있다고 생각합니다."
    },
    {
      "id": "isfj",
      "name": "박수진",
      "department": "인사팀",
      "position": "인사부장",
      "experience": "12년차",
      "personaRef": "isfj.json",
      "stance": "현지 직원들의 사기와 고용 안정성은 회사의 지속적인 성장을 위한 핵심 자산입니다. 아무리 법이 강화되었더라도 직원들에게 일방적인 희생을 강요하거나 갑작스러운 해고는 피해야 합니다. 상생할 수 있는 방안을 찾아야 합니다.",
      "goal": "현지 직원들이 새로운 법률 하에서도 안정적인 고용 환경과 합당한 대우를 받을 수 있도록 하는 것. 불필요한 인력 감축을 막는 것.",
      "tradeoff": "직원 복지를 최대한 유지하는 선에서 회사의 재정적 어려움을 이해하고, 합리적인 수준의 복지 조정이나 인센티브 제안은 고려할 수 있습니다."
    },
    {
      "id": "infj",
      "name": "최윤서",
      "department": "기획팀",
      "position": "전략기획 담당",
      "experience": "8년차",
      "personaRef": "infj.json",
      "stance": "단순히 법을 준수하거나 비용을 줄이는 것을 넘어, 이번 사태를 통해 우리 기업이 글로벌 시장에서 어떤 가치를 추구하고 어떤 기업으로 비춰질지에 대한 근본적인 고민이 필요합니다. 장기적인 관점에서 지속 가능한 사업 모델을 구축해야 합니다.",
      "goal": "이번 위기를 통해 해외 법인의 사업 모델을 재정의하고, 기업의 사회적 책임과 지속 가능한 성장을 동시에 달성할 수 있는 혁신적인 전략을 수립하는 것.",
      "tradeoff": "당장의 비용 절감보다는 미래 성장 동력 확보 및 기업 이미지 제고를 위한 투자를 중요하게 생각하나, 현실적인 재정 상황을 고려하여 단계적인 접근은 수용할 수 있습니다."
    }
  ],
  "recommendedFlow": [
    "istj",
    "isfj",
    "infj"
  ],
  "difficulty": 3,
  "estimatedTime": "60-90분",
  "skills": [
    "갈등 중재",
    "협상",
    "문제 해결",
    "의사소통",
    "리더십",
    "전략적 사고",
    "법률 지식 활용"
  ],
  "image": null
}